# coding: utf8
import re

_first_level_keywords = (
    ' жена', ' жени', 'съпруга', 'дъщеря', 'внучк', 'девойк', 'момиче', 'студентк', 'ученичк',
    'баба', 'домашното насилие', 'домашно насилие', 'годеница', 'приятелк', 'гимназистк',
    'майка', 'дъщери')
_second_level_keywords = ('домашно насилие', 'уби', 'стрел', 'мушк', 'обезобраз', 'преби', 'наказан',
                          'изнасил', 'тормоз', 'насил', ' рани', ' стрел', 'сигнал', 'осъд', 'смъртта',
                          'криминалн',
                          'намерен', ' полиц', 'насилван', 'запов')

# txt = 'Куриозен случай от столицата – жена купува от квартален магазин локумена вафла, но при отхапването ѝ открива, че освен локум във вафлата има и камъни. Какво е състоянието на жената и каква е причината да бъде допусната подобна грешка от фирмата производител?  „Уви, след няколко хапки усетих, че нещо започва да хрущи. Погледнах и видях камъчета, които приличат на чакъл. Това доста ме притесни и веднага се върнах до магазина. Запазих вафлата и се свързах с Комисията за защита на потребителите, писах и на фирмата дистрибутор, чието име е изписано навсякъде по опаковката. На следващия ден те се свързаха с мен и потвърдиха, че ще се свържат с фирмата, направила вафлата. Предоставих им партидния номер и очаквам някаква реакция“, разказа пред bTV Михаела Спиридонова.  „Вафлата беше запечатана и в срок на годност. Има липса на контрол“, посочи още тя. „От магазина реагираха веднага, взеха и снимките, които бях направила. Казаха, че когато дойде и човекът, който им докарва тези вафли, ще му дадат информацията. Все още нямам отговор от Агенцията по безопасност на храните. Голяма късметлийка съм, че не успях да се нараня, защото не отхапах силно“, сподели още жената. Агенцията по безопасност на храните ще извърши проверка на фирмата производител. Партидата ще бъде спряна от продажба и ще се извърши анализ на причините, довели до замърсяването. От фирмата дистрибутор се извиниха и обещаха да проверят работат на производитела. "Това е първият такъв инцидент и силно сме обезпокоени от него. За нас е повече от недопустимо да се случват подобни неща", се казва в позиция на дистрибутора. Потърсихме позицията и на производителя, но не получихме отговор.'

title = 'Полицията издирва близките на жена, намерена на бензиностанция в Бургас'
txt = 'Полицията в Бургас търси съдействие за установяване на самоличността на жена. Възрастна жена е намерена около 22 часа снощи на бензиностанция в бургаския комплекс "Меден Рудник". Тя твърди, че се казва Ганка. В нея е открит ж.п. билет по направлението Айтос-Карнобат.  Издирва се информация за самоличността на жената или нейни близки. Който разполага с такава да позвъни на тел. 112 или в най-близкото полицейско поделение. Жената е в Четвърто РУ-Бургас.'

# for word in first:
#     if word in title.lower():
#         print(word)
[print(word) for word in _first_level_keywords if word in re.sub(r'[.|,!?:„“;\-()"\\/{}\]\[`=]', ' ', " " + title.lower())]

# for word in second:
#     if word in txt.lower():
#         print(word)
[print(word) for word in _second_level_keywords if word in txt.lower()]
# print(re.sub(r'[.|,|!|?|:|„|“|;|\-|(|)|"]', ' ', " " + title.lower()))
print(re.sub(r'[.|,!?:„“;\-()"\\/{}\]\[`=]', ' ', " " + title.lower()))


